[
  {
    "title": "INTJ",
    "name": "นักออกแบบ",
    "type": "analysts",
    "fullDesc": "เป็นคนที่ให้ความสำคัญกับวิสัยทัศน์ ความหมาย และความเป็นไปได้ พวกเขาใช้เวลาส่วนมากอยู่กับการคิดถึงสิ่งที่อยู่ในอนาคต และสิ่งที่เป็นนามธรรม ชอบความซับซ้อนและสิ่งที่มีความท้าทายสูง สร้างสรรค์ เห็นความเป็นไปได้ใหม่ๆ นอกจากนี้พวกเขายังเป็นคนที่ใช้เหตุผลในการตัดสินใจและมองสิ่งต่างๆ อย่างเป็นกลาง โดยที่ INTJ จะสามารถมองเห็นข้อผิดพลาดของสิ่งต่างๆ ที่เกิดขึ้นได้อย่างง่ายดายจากการใช้เหตุผลของเขา",
    "shortDesc": "บุคลิกแบบ INTJ อยู่ใน <span class='font-semibold text-analysts underline underline-offset-4'>กลุ่มนักวิเคราะห์ (Analysis)</span> มีจินตนาการสูงและเป็นนักคิดกลยุทธ์ที่มีแผนการสำหรับทุกอย่าง"
  },
  {
    "title": "INTP",
    "name": "นักตรรกะ",
    "type": "analysts",
    "fullDesc": "เป็นบุคลิกภาพที่เก่งในด้านของการวิเคราะห์ปัญหา ความคิด หรือสถานการณ์ด้วยการใช้ตรรกะ เขาใช้กระบวนการคิดอย่างเป็นระบบในการหาคำตอบสิ่งต่างๆ เขามักจะมีคำถามกับสิ่งต่างๆ จากมุมมองของตัวเอง ระบบตรรกะของตัวเอง ยังเห็นความเป็นไปได้ใหม่ๆ มองสิ่งต่างๆ เป็นทฤษฎี ภาพรวม และมองหาหลักการที่อยู่เบื้องหลังของสิ่งที่ปรากฏออกมา เขามักใช้ตรรกะ สิ่งที่เคยเห็น และทฤษฎีต่างๆ หลอมรวมขึ้นมาเพื่อหาความเป็นไปได้ใหม่ๆ ที่ดีกว่าเดิม",
    "shortDesc": "บุคลิกแบบ INTP อยู่ใน <span class='font-semibold text-analysts underline underline-offset-4'>กลุ่มนักวิเคราะห์ (Analysis)</span> นักคิดค้นนวัตกรรมที่มีความกระหายความรู้อย่างไม่มีที่สิ้นสุด"
  },
  {
    "title": "ENTJ",
    "name": "ผู้บัญชาการ",
    "type": "analysts",
    "fullDesc": "เป็นคนที่ให้ความสำคัญเกี่ยวกับผู้คนและมิตรภาพ พวกเขามักจะชอบอยู่ท่ามกลางผู้คนและเข้าใจความต้องการคุณค่าสิ่งที่แต่ละคนต้องการ พวกเขาชอบอุทิศตัวเองไปกับการช่วยเหลือคนอื่น นอกจากนั้น ENFJ ยังเป็นคนที่มักจะเห็นความเป็นไปได้ใหม่ๆ มองเห็นความเชื่อมโยง และความหมายที่อยู่เบื้องหลังสิ่งต่างๆ เขามักจะเป็นคนที่มีความสร้างสรรค์ มองเห็นความเป็นไปได้ และความเชื่อมโยง",
    "shortDesc": "บุคลิกแบบ ENTJ อยู่ใน <span class='font-semibold text-analysts underline underline-offset-4'>กลุ่มนักวิเคราะห์ (Analysis)</span> กล้าหาญ มีจิตนาการ และเป็นผู้นำเด็ดเดี่ยว มักหาทางออกหรือสร้างทางออกขึ้นมาได้เสมอ"
  },
  {
    "title": "ENTP",
    "name": "นักโต้วาที",
    "type": "analysts",
    "fullDesc": "เป็นคนที่เห็นความเป็นไปได้ของสิ่งต่างที่อยู่รอบตัวอย่างรวดเร็ว เขาสนใจแนวความคิดเบื้องหลังของสิ่งเหล่านั้น เพื่อที่จะคาดเดาอนาคต และมักชอบความท้าทาย ชอบที่จะเปลี่ยนแปลงและรับมือกับสิ่งต่างๆ แบบฉับพลัน นอกจากนั้น ENTP เป็นคนที่เก่งในเรื่องกระบวนการคิดวิเคราะห์ เขามักจะนำความเป็นไปได้ใหม่ๆ มาวิเคราะห์ และเมื่อต้องตัดสินใจ เขามักจะเป็นคนที่ใช้ตรรกะ เหตุผล ชอบแก้ปัญหาในมุมมองที่เป็นภาพรวมมากกว่าแก้ปัญหาเฉพาะหน้าเป็นเรื่องๆ ชอบวิเคราะห์ผู้คน อ่านคน ประกอบกับการทำสิ่งต่างๆอีกด้วย",
    "shortDesc": "บุคลิกแบบ ENTP อยู่ใน <span class='font-semibold text-analysts underline underline-offset-4'>กลุ่มนักวิเคราะห์ (Analysis)</span> ฉลาดและเป็นนักคิดช่างสงสัยที่ไม่สามารถห้ามใจไม่ให้รับคำท้าทายสมอง"
  },
  {
    "title": "INFJ",
    "name": "ผู้แนะนำ",
    "type": "diplomats",
    "fullDesc": "เป็นคนที่มักจะให้ความสำคัญกับวิสัยทัศน์ ความหมาย และความสัมพันธ์ระหว่างสิ่งต่างๆ กับผู้คน พวกเขามักใช้เวลาไปกับการพยายามทำความเข้าใจสิ่งที่มีความซับซ้อนที่อยู่ภายในหรือความหมายในชีวิต และพวกเขาชอบใช้การเปรียบเทียบ สัญลักษณ์ หรือคำศัพท์ที่มีความหมายเฉพาะตัว เป็นคนที่ให้ความสำคัญกับคุณค่าของผู้คน สังคม เขามักจะตัดสินใจสิ่งต่างๆ โดยใช้คุณค่าและผลกระทบที่มีต่อผู้คนเป็นหลัก เข้าใจผู้คน เร็วต่อความรู้สึก เป็นคนเงียบ ๆ และดูลึกลับ แต่มักสร้างแรงบันดาลใจและยึดมั่นใน อุดมการณ์อย่างไม่เหน็ดเหนื่อย",
    "shortDesc": "บุคลิกแบบ INFJ อยู่ใน <span class='font-semibold text-diplomats underline underline-offset-4'>กลุ่มนักการฑูต (Diplomats)</span> เป็นคนเงียบ ๆ และดูลึกลับ แต่มักสร้างแรงบันดาลใจและยึดมั่นในอุดมการณ์อย่างไม่เหน็ดเหนื่อย"
  },
  {
    "title": "INFP",
    "name": "ผู้ไกล่เกลี่ย",
    "type": "diplomats",
    "fullDesc": "เป็นคนที่ขับเคลื่อนโดยคุณค่า หรือความรู้สึกภายใน INFP เป็นคนที่เข้าใจสภาวะอารมณ์และจิตใจของคนอื่น คุณค่า และสิ่งต่างๆ ที่เกิดขึ้นกับคนอื่น พวกเขาเป็นคนที่เร็วต่อความรู้สึก และเข้าใจผู้คน มีซื่อสัตย์ต่อความรู้สึกของตัวเอง ให้ความสำคัญเกี่ยวกับอุดมคติ อุดมการณ์ มักชอบพูดคุยสิ่งที่เป็นไปได้ในอนาคต สิ่งที่จะทำให้ชีวิตของคนอื่นดีขึ้น แม้ว่าเขาจะเข้าใจความรู้สึกของแต่ละคนเป็นอย่างดี แต่เขาก็ชอบมองภาพรวม และมองหาความเป็นไปได้ใหม่ๆ อยู่เสมอ มองการณ์ไกล มีความสร้างสรรค์ เปิดรับต่อความเป็นไปได้ใหม่ๆ",
    "shortDesc": "บุคลิกแบบ INFP อยู่ใน <span class='font-semibold text-diplomats underline underline-offset-4'>กลุ่มนักการฑูต (Diplomats)</span> เป็นนักกวี ใจดี และเห็นใจผู้อื่น มีความกระตือรือร้นที่จะช่วยเหลือเพื่อสร้างสิ่งดี ๆ ให้กับสังคม"
  },
  {
    "title": "ENFJ",
    "name": "ตัวเอก",
    "type": "diplomats",
    "fullDesc": "เป็นคนที่ให้ความสำคัญเกี่ยวกับผู้คนและมิตรภาพ พวกเขามักจะชอบอยู่ท่ามกลางผู้คนและเข้าใจความต้องการ คุณค่า สิ่งที่แต่ละคนต้องการ พวกเขาชอบอุทิศตัวเองไปกับการช่วยเหลือคนอื่น มักจะเห็นความเป็นไปได้ใหม่ๆ มองเห็นความเชื่อมโยง และความหมายที่อยู่เบื้องหลังสิ่งต่างๆ ENFJ มักจะเห็นความเป็นไปได้และศักยภาพในตัวผู้คนอยู่เสมอ และพยายามช่วยเหลือผู้คนรอบตัวเขาให้บรรลุศักยภาพในแบบที่พวกเขาสามารถเป็นได้",
    "shortDesc": "บุคลิกแบบ ENFJ อยู่ใน <span class='font-semibold text-diplomats underline underline-offset-4'>กลุ่มนักการฑูต (Diplomats)</span> มีเสน่ห์และเป็นผู้นำที่มักสร้างแรงบันดาลใจ สามารถจับใจผู้ฟังได้เสมอ"
  },
  {
    "title": "ENFP",
    "name": "นักรณรงค์",
    "type": "diplomats",
    "fullDesc": "เป็นคนที่เห็นความเป็นไปได้ของสิ่งต่างที่อยู่รอบตัวอย่างรวดเร็ว เขาสนใจแนวความคิดเบื้องหลังของสิ่งเหล่านั้น เพื่อที่จะคาดเดาอนาคต และมักชอบความท้าทาย ชอบที่จะเปลี่ยนแปลงและรับมือกับสิ่งต่างๆ แบบฉับพลัน มีความคิดสร้างสรรค์ สนใจระบบ ภาพรวม ทฤษฎี และความเป็นไปได้ เป็นคนที่เก่งในเรื่องกระบวนการคิดวิเคราะห์ เขามักจะนำความเป็นไปได้ใหม่ๆ มาวิเคราะห์ และเมื่อต้องตัดสินใจ เขามักจะเป็นคนที่ใช้ตรรกะ เหตุผล ตั้งคำถามเกี่ยวกับสิ่งเหล่านั้นเพื่อหามุมมองใหม่ๆ มีมุมมองที่เป็นกลาง",
    "shortDesc": "บุคลิกแบบ ENFP อยู่ใน <span class='font-semibold text-diplomats underline underline-offset-4'>กลุ่มนักการฑูต (Diplomats)</span> มีความกระตือรือร้น มีความคิดสร้างสรรค์ และมีมนุษย์สัมพันธ์ที่ดี เป็นคนที่สามารถหาเหตุผลให้ยิ้มได้เสมอ"
  },
  {
    "title": "ISTJ",
    "name": "นักคำนวณ",
    "type": "sentinels",
    "fullDesc": "เป็นบุคลิกภาพที่ให้ความสำคัญ เกี่ยวกับความรับผิดชอบ หน้าที่ ที่มีต่องาน ครอบครัวและความสัมพันธ์ พวกเขาเป็นคนที่มองโลกตามความเป็นจริงและใช้เหตุผลในการตัดสินใจ นอกจากนี้พวกเขายังให้ความสำคัญกับสิ่งที่ผ่านมา สิ่งที่พวกเขาเคยเผชิญ และเรียนรู้จากสิ่งเหล่านั้น นอกจากนี้พวกเขายังเป็นคนที่ใช้เหตุผลในการตัดสินใจและมองสิ่งต่างๆ อย่างเป็นกลาง โดยที่ ISTJ จะสามารถมองเห็นข้อผิดพลาดของสิ่งต่างๆ ที่เกิดขึ้นได้อย่างง่ายดายจากการใช้เหตุผลของเขา",
    "shortDesc": "บุคลิกแบบ ISTJ อยู่ใน <span class='font-semibold text-sentinels underline underline-offset-4'>กลุ่มผู้เฝ้ายาม (sentinels)</span> เป็นคนที่อยู่กับความเป็นจริง และเป็นคนชอบเสาะหาข้อเท็จจริง ไม่ยอมให้มีข้อสงสัยเหลืออยู่"
  },
  {
    "title": "ISFJ",
    "name": "ผู้ตั้งรับ",
    "type": "sentinels",
    "fullDesc": "ISFJ เป็นบุคลิกภาพที่ดูพึ่งพาได้ มักจะให้ความสำคัญกับเพื่อนและกลุ่มที่พวกเขาอยู่ด้วย เขามักจะมีท่าทีใจดีและให้ความสำคัญกับครอบครัวเป็นลำดับต้นๆ นอกจากนี้เขายังเป็นคนที่ให้ความสำคัญกับข้อเท็จจริง พวกเขามีความทรงจำที่ยอดเยี่ยมในเรื่องที่เกี่ยวข้องกับผู้คนเช่น น้ำเสียง สีหน้า การแสดงออก นอกจากนี้พวกเขายังเป็นคนที่ให้ความสำคัญเกี่ยวกับผู้คน โดยอาจแสดงออกผ่านทางคุณค่าของสังคม วัฒนธรรม หรือการเห็นพ้องต้องกัน มักมองหาทางออกที่สร้างความสมานฉันท์ ปรองดอง และไม่สร้างความขัดแย้ง",
    "shortDesc": "บุคลิกแบบ ISTJ อยู่ใน <span class='font-semibold text-sentinels underline underline-offset-4'>กลุ่มผู้เฝ้ายาม (sentinels)</span> เป็นคนที่มีมีความละเอียดอ่อน และเป็นผู้ปกป้องที่ดี มักพร้อมที่จะปกป้องคนที่รักเสมอ"
  },
  {
    "title": "ESTJ",
    "name": "ผู้บริหาร",
    "type": "sentinels",
    "fullDesc": "เป็นคนที่มีระบบตรรกะและกระบวนการคิดค่อนข้างมาก มักจะใช้กระบวนการคิดและวิเคราะห์ในชีวิตประจำวันและทำงานได้อย่างยอดเยี่ยม นอกจากนั้น ESTJ ให้ความสำคัญกับสิ่งที่เกิดขึ้นในปัจจุบันและจับต้องได้มากกว่าจินตนาการ แนวความคิด หรือทฤษฎี เขามักเป็นคนที่มีความมั่นคง ในสถานการณ์ต่างๆ เขามักจะให้คุณค่ากับ สิ่งที่เป็นไปได้ในเชิงปฏิบัติ ปัจจุบัน และประสบการณ์ มักจะเป็นคนที่สามารถจัดการะบบของสิ่งต่างๆ ได้ยอดเยี่ยม รวมทั้งการติดต่อพูดคุยกับผู้คน เพราะพวกเขามักจะคิดวิเคราะห์สถานการณ์และทางเลือกต่างๆ ไปพร้อมกับการเปรียบเทียบกับประสบการณ์ในอดีต",
    "shortDesc": "บุคลิกแบบ ESTJ อยู่ใน <span class='font-semibold text-sentinels underline underline-offset-4'>กลุ่มผู้เฝ้ายาม (sentinels)</span> มักเป็นนักบริหารที่ดี มีความโดดเด่นเรื่องการบริหารเรื่องต่าง ๆ หรือบุคคลากร"
  },
  {
    "title": "ESFJ",
    "name": "ผู้ให้คำปรึกษา",
    "type": "sentinels",
    "fullDesc": "เป็นคนที่ชอบช่วยเหลือคนอื่น ให้ความสำคัญในสิ่งที่เกี่ยวข้องกับผู้คน เขามักจะชอบอยู่ในสถานที่ที่แวดล้อมไปด้วยผู้คน และชอบงานเลี้ยงสังสรรค์ ห้ความสำคัญเกี่ยวกับระบบประเพณี วัฒนธรรม และคุณค่าส่วนรวมด้วย มักเป็นคนที่ เห็นใจคนอื่น ชอบช่วยเหลือคนอื่น เป็นกันเอง ชอบการมีปฏิสัมพันธ์ และการร่วมแรงร่วมใจ ให้ความสำคัญกับสิ่งที่เป็นไปได้จริงมากกว่าสิ่งที่อาจเกิดขึ้นในอนาคต โดยพวกเขาอาจเปรียบเทียบสิ่งที่เกิดขึ้นกับประสบการณ์ที่ผ่านมา เขาเป็นคนที่ทำงานที่มีระบบหรือมีรายละเอียดได้ดี โดยเฉพาะรายละเอียดที่มีความเกี่ยวข้องกับผู้คน อยู่กับความเป็นจริงและปัจจุบัน",
    "shortDesc": "บุคลิกแบบ ESTJ อยู่ใน <span class='font-semibold text-sentinels underline underline-offset-4'>กลุ่มผู้เฝ้ายาม (sentinels)</span> เป็นคนที่มีความเป็นห่วงเป็นใยมากเป็นพิเศษ มีมนุษย์สัมพันธ์และเป็นที่รักของผู้คน มักกระตือรือร้นเสนอความช่วยเหลือผู้อื่น"
  },
  {
    "title": "ISTP",
    "name": "ผู้เชี่ยวชาญศิลปะ",
    "type": "explorers",
    "fullDesc": "ISTP ชอบสังเกตสิ่งที่เกิดขึ้นรอบตัวในปัจจุบัน และนำสิ่งเหล่านั้นมาวิเคราะห์ ประมวลผล พวกเขาเป็นนักแก้ปัญหาที่ใช้ข้อมูลที่ได้รับมาทุกอย่างในการตรวจสอบปัญหา และพร้อมที่จะปรับตัวกับความท้าทายใหม่ๆ เป็นคนที่ใช้เวลาอยู่กับปัจจุบัน เขาชอบเรียนรู้จากสิ่งที่จับต้องได้จริงมากกว่าทฤษฎี นามธรรม เขาจะรับมือกับสถานการณ์ที่เปลี่ยนแปลงอยู่เสมอได้ดี",
    "shortDesc": "บุคลิกแบบ ISTP อยู่ใน <span class='font-semibold text-explorers underline underline-offset-4'>กลุ่มนักสำรวจ (Explorer)</span> กล้าหาญและเป็นนักทดลองที่อยู่บนพื้นฐานความเป็นจริง เก่งกาจในการใช้เครื่องมือทุกชนิด"
  },
  {
    "title": "ISFP",
    "name": "นักผจญภัย",
    "type": "explorers",
    "fullDesc": "ISFP เป็นคนความร่าเริงและเบิกบาน เขามักจะชอบอิสระและทำอะไรตามอำเภอใจตนเอง ให้ความสำคัญเกี่ยวกับเรื่องความสัมพันธ์ ความสนิทสนมกับคนอื่นค่อนข้างมาก แต่เขามักจะใช้เวลาในการพัฒนาความสนิทสนมขึ้นอย่างช้าๆ และมักจะเอาใจใส่คนใกล้ชิด คนสำคัญอย่างพิเศษในวิธีของตัวเอง เป็นคนอ่อนไหวต่อความรู้สึกใส่ใจในรายละเอียดกับที่เกิดขึ้นรอบตัว เขามักจะชอบสิ่งที่เป็นไปได้จริง และเรียนรู้ผ่านการลงมือทำมากกว่าการจินตนาการถึงแนวคิดที่ช่างฝัน",
    "shortDesc": "บุคลิกแบบ ISFP อยู่ใน <span class='font-semibold text-explorers underline underline-offset-4'>กลุ่มนักสำรวจ (Explorer)</span> มีความยืดหยุ่นสูง และเป็นศิลปินทรงเสน่ห์ มักพร้อมสำรวจและทดลองสิ่งใหม่ ๆ อยู่เสมอ"
  },
  {
    "title": "ESTP",
    "name": "ผู้ประกอบการ",
    "type": "explorers",
    "fullDesc": "เป็นคนที่มีพลังงานมาก เขาเป็นนักแก้ไขปัญหา ชอบความสนุกสนาน เขาเป็นคนที่ปรับตัวเข้ากับสภาพแวดล้อม ได้อย่างยอดเยี่ยม รวมทั้งยังสามารถแก้ปัญหาเฉพาะหน้าได้ดีด้วย ESTP มักให้ความสำคัญเกี่ยวกับรายละเอียดเล็กๆ น้อยๆ เป็นคนที่ใช้ตรรกะในการตัดสินใจมากกว่าอารมณ์ความรู้สึก ESTP เป็นคนที่เก่งในเรื่องของการอยู่กับความเป็นจริง เขาชอบสิ่งที่ลงมือปฏิบัติได้จริงมากกว่าไอเดีย ทฤษฎีต่างๆ แต่เขาก็ให้ความสนใจเหตุผลที่อยู่เบื้องหลังสิ่งเหล่านั้นด้วย",
    "shortDesc": "บุคลิกแบบ ESTP อยู่ใน <span class='font-semibold text-explorers underline underline-offset-4'>กลุ่มนักสำรวจ (Explorer)</span> มักจะฉลาด กระฉับกระเฉง และเข้าใจผู้อื่นได้เป็นอย่างดี มีความสุขกับการใช้ชีวิตแบบสุดโต่ง"
  },
  {
    "title": "ESFP",
    "name": "ผู้มอบความบันเทิง",
    "type": "explorers",
    "fullDesc": "ชอบใช้เวลาอยู่กับปัจจุบัน เขาชอบหาอะไรทำ มีพลังงานมากมายเหลือล้น และชอบประสบการณ์ใหม่ๆ พวกเขามักมองเห็นรายละเอียดที่เกี่ยวข้องกับผู้คน แต่มักจะไม่ชอบทำกิจกรรมที่มีความจำเจ เป็นคนที่อ่อนโยน รับรู้ความรู้สึกของคนอื่นๆ ได้เร็ว เขาตัดสินใจด้วยการใช้คุณค่าส่วนตัวเป็นหลัก และให้ความสำคัญกับความรู้สึกของคนอื่น เข้าใจความรู้สึกของผู้คน เป็นมิตร มีทักษะทางสังคมที่ดี",
    "shortDesc": "บุคลิกแบบ ESFP อยู่ใน <span class='font-semibold text-explorers underline underline-offset-4'>กลุ่มนักสำรวจ (Explorer)</span> ใช้สัญชาตญาณ กระฉับกระเฉง และ กระตือรือร้น ไม่มีความเบื่อหน่ายเกิดขึ้นในชีวิต"
  }
]
